rendering improvements
